app/src/main/file/b.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <SaveDocument xmlns="http://www.xsjky.cn/">
            <securityInfo>
                <UserId>49</UserId>
                <ClientName>XinShiJi.Mobile.Android.Employee</ClientName>
                <SessionId>669cd1b0-d675-4991-988b-ce6b4e1c9eda</SessionId>
            </securityInfo>
            <document>
                <BalanceBy>0</BalanceBy>
                <BalanceMode>SenderPay</BalanceMode>
                <BalanceTime>0001-01-01T00:00:00</BalanceTime>
                <Carriage>0.0</Carriage>
                <CarriageItems>
                    <ShipperCost>
                        <ChargeValue>-1.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>true</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>1</ItemId>
                            <ItemName>干线运费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>2</ItemId>
                            <ItemName>包装费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>3</ItemId>
                            <ItemName>提货费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>4</ItemId>
                            <ItemName>制单费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>7</ItemId>
                            <ItemName>送货上楼费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>8</ItemId>
                            <ItemName>物控费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>1009</ItemId>
                            <ItemName>其他费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>0.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>false</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>1010</ItemId>
                            <ItemName>签回单</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                    <ShipperCost>
                        <ChargeValue>-1.0</ChargeValue>
                        <DocumentId>0</DocumentId>
                        <FreightItem>
                            <AllowEdit>true</AllowEdit>
                            <IsCalculate>true</IsCalculate>
                            <IsEnabled>true</IsEnabled>
                            <ItemId>1011</ItemId>
                            <ItemName>中转费</ItemName>
                        </FreightItem>
                        <RecordId>0</RecordId>
                    </ShipperCost>
                </CarriageItems>
                <ConsigneeAddress>
                    <Address>下十围</Address>
                    <AddressId>0</AddressId>
                    <City>安庆市</City>
                    <District>枞阳县</District>
                    <PostCode>246000</PostCode>
                    <Province>安徽省</Province>
                </ConsigneeAddress>
                <ConsigneeAreaCode>0556</ConsigneeAreaCode>
                <ConsigneeCode>0</ConsigneeCode>
                <ConsigneeContactPerson>李达</ConsigneeContactPerson>
                <ConsigneeName>新世纪</ConsigneeName>
                <ConsigneePhoneNumber>15067080345;797997877</ConsigneePhoneNumber>
                <CountWeight>1</CountWeight>
                <CreateTime>2017-03-07T16:13:29.9462033+08:00</CreateTime>
                <Creator>49</Creator>
                <DeliveredBy></DeliveredBy>
                <DeliveryAfterNotify>false</DeliveryAfterNotify>
                <DeliveryCharge>0.0</DeliveryCharge>
                <DocumentNumber>6754848</DocumentNumber>
                <EditLock>false</EditLock>
                <EditingUser>0</EditingUser>
                <FromCity>深圳</FromCity>
                <FromNetwork>
                    <IsDisabled>false</IsDisabled>
                    <ManagerId>0</ManagerId>
                    <NetworkCode>0755</NetworkCode>
                    <NetworkId>263</NetworkId>
                    <NetworkName>深圳</NetworkName>
                    <ParentId>0</ParentId>
                </FromNetwork>
                <GoodsAmount>0</GoodsAmount>
                <InsuranceAmt>1</InsuranceAmt>
                <IsCarriageBalance>false</IsCarriageBalance>
                <IsConfirm>false</IsConfirm>
                <IsFinished>false</IsFinished>
                <LockTime>0001-01-01T00:00:00</LockTime>
                <MonthlyBalanceAccount>0</MonthlyBalanceAccount>
                <NeedDelivery>false</NeedDelivery>
                <NeedInsurance>false</NeedInsurance>
                <NeedSignUpNotifyMessage>false</NeedSignUpNotifyMessage>
                <PickupBy></PickupBy>
                <Premium>-1.0</Premium>
                <ProductName>手机</ProductName>
                <Quantity>1</Quantity>
                <RecordId>0</RecordId>
                <Remarks></Remarks>
                <ShipperAddress>
                    <Address>汉海达创业园</Address>
                    <AddressId>0</AddressId>
                    <City>深圳市</City>
                    <District>公明区</District>
                    <Province>广东省</Province>
                </ShipperAddress>
                <ShipperAreaCode></ShipperAreaCode>
                <ShipperCode>364</ShipperCode>
                <ShipperContactName>农</ShipperContactName>
                <ShipperName>东方丝路</ShipperName>
                <ShipperPhoneNumber>18998903543</ShipperPhoneNumber>
                <ShippingMode>
                    <IsEnabled>true</IsEnabled>
                    <ModeId>1</ModeId>
                    <ModeName>卡航</ModeName>
                </ShippingMode>
                <ShippingStatus>IsApplied</ShippingStatus>
                <ToCity>深圳</ToCity>
                <TotalCharge>0.0</TotalCharge>
                <Upstair>false</Upstair>
                <Volumn>1.0</Volumn>
                <Weight>1.0</Weight>
                <WoodenFrames/>
            </document>
        </SaveDocument>
    </soap:Body>
</soap:Envelope>